runs/n2412_full/Allrun
#!/bin/sh
# Freestream-initialised simpleFoam run. Execute inside the OpenFOAM environment.
cd "${0%/*}" || exit 1
gmshToFoam mesh.msh                       > log.gmshToFoam 2>&1
python3 set_patch_types.py .
renumberMesh -overwrite                   > log.renumberMesh 2>&1
checkMesh                                 > log.checkMesh 2>&1
simpleFoam                                2>&1 | tee log.simpleFoam
echo "done. Cl/Cd -> postProcessing/forceCoeffs/  |  residuals -> log.simpleFoam"
